yes_no_choices = [("01", "Да"), ("10", "Нет")]

sex_choices = [("01", "Мужской"), ("10", "Женский")]

martial_status_choices = [("01", "Замужем/женат"), ("10", "Холост")]

living_choices = [("01", "с родителями"), ("10", "отдельно от родителей")]

children_choices = [("01", "есть дети"), ("10", "нет детей")]

work_status_choices = [
    ("001", "учусь"),
    ("010", "работаю"),
    ("011", "учусь и работаю"),
    ("100", "не учусь и не работаю"),
]

answer_choices = [
    ("0001", "-1"),
    ("0010", "0"),
    ("0011", "1"),
    ("0100", "2"),
    ("0101", "3"),
    ("0110", "4"),
    ("0111", "5"),
    ("1000", "6"),
    ("1001", "7"),
    ("001", "1 Очень похож на меня"),
    ("010", "2 Похож на меня"),
    ("011", "3 В некоторой степени похож на меня"),
    ("100", "4 Немного похож на меня"),
    ("101", "5 Не похож на меня"),
    ("110", "6 Совсем не похож на меня"),
]

choices_db = {
    "yes_no": {"да": "01", "нет": "10"},
    "sex": {"Мужской": "01", "Женский": "10"},
    "marital_status": {"замужем/женат": "01", "Холост": "10"},
    "living": {"с родителями": "01", "отдельно от родителей": "10"},
    "children": {"есть дети": "01", "нет детей": "10"},
    "work_status": {
        "учусь": "001",
        "работаю": "010",
        "учусь и работаю": "011",
        "не учусь и не работаю": "100",
    },
    "answer": {
        "-1": "0001",
        "0": "0010",
        "1": "0011",
        "2": "0100",
        "3": "0101",
        "4": "0110",
        "5": "0111",
        "6": "1000",
        "7": "1001",
        "1 Очень похож на меня": "001",
        "2 Похож на меня": "010",
        "3 В некоторой степени похож на меня": "011",
        "4 Немного похож на меня": "100",
        "5 Не похож на меня": "101",
        "6 Совсем не похож на меня": "110",
    },
}
